raphui/rnk/include/dt-bindings/stm32lx-clock.h
#ifndef _DT_BINDINGS_CLK_STMLX_H
#define _DT_BINDINGS_CLK_STMLX_H

#define SYSTICK			0
#define FCLK			1
#define CLK_LSI			2
#define CLK_LSE			3
#define CLK_MSI			4
#define CLK_RTC			5
#define CLK_HSI			6
#define CLK_HSI48		7
#define CLK_SYSCLK		8
#define CLK_PLL			9
#define CLK_AHB			10
#define CLK_APB1		11
#define CLK_APB2		12	

#define END_PRIMARY_CLK		20	

#define CLK_HDMI_CEC		16
#define CLK_SPDIF		17
#define CLK_USART1		18
#define CLK_USART2		19
#define CLK_USART3		20
#define CLK_UART4		21
#define CLK_UART5		22
#define CLK_USART6		23
#define CLK_UART7		24
#define CLK_UART8		25
#define CLK_I2C1		26
#define CLK_I2C2		27
#define CLK_I2C3		28
#define CLK_I2C4		29
#define CLK_LPTIMER		30

#define END_PRIMARY_CLK_F7	31

#endif
